demo-ruby-classes-rails-api/app/services/animal_service.rb

  def self.list_all
    Animal.all.to_a
---
SELECT "animals".* FROM "animals"

  def self.create(params)
    ActiveRecord::Base.transaction do
      animal = Animal.new(
        name: params[:name],
        noise: params[:noise]
      )

      if animal.save
        # Handle food relationships if provided
        if params[:foods].present?
          params[:foods].each do |food_name|
            # Find or create the food
            food = Food.find_or_create_by!(name: food_name)

            # Create the relationship
            AnimalLikesFood.create!(
              animal_name: animal.name,
              food_name: food.name
            )
---
INSERT INTO "animals" ("name", "created_at", "updated_at", "noise") VALUES ('Cat', '2025-03-30 18:46:12.072015', '2025-03-30 18:46:12.072015', 'meow') RETURNING "name"
INSERT INTO "foods" ("name", "created_at", "updated_at") VALUES ('Cat Food', '2025-03-30 18:46:12.120233', '2025-03-30 18:46:12.120233') RETURNING "name"
SELECT "foods".* FROM "foods" WHERE "foods"."name" = 'Cat Food' LIMIT 1
INSERT INTO "animal_likes_foods" ("animal_name", "food_name", "created_at", "updated_at") VALUES ('Cat', 'Cat Food', '2025-03-30 18:46:12.181672', '2025-03-30 18:46:12.181672') RETURNING "id"

  def self.check_animal_likes_food(animal_name:, food_name:)
    # Check if relationship exists first (this is the fastest query due to the index)
    relationship = AnimalLikesFood.find_by(animal_name: animal_name, food_name: food_name)

    if relationship
      # If relationship exists, we know both animal and food exist, just get animal's noise
      animal = Animal.find(animal_name)
      return { success: true, data: "#{animal.noise} #{animal.noise} #{animal.noise}", status: :ok }
    end

    # If no relationship, check if animal exists
    animal = Animal.find_by(name: animal_name)
    return { success: false, error: "Animal not found", status: :not_found } unless animal

    # Check if food exists
    food = Food.find_by(name: food_name)
---
SELECT "animal_likes_foods".* FROM "animal_likes_foods" WHERE "animal_likes_foods"."animal_name" = 'Dog' AND "animal_likes_foods"."food_name" = 'Cat Food' LIMIT 1
SELECT "animals".* FROM "animals" WHERE "animals"."name" = 'Dog' LIMIT 1
SELECT "foods".* FROM "foods" WHERE "foods"."name" = 'Cat Foodf' LIMIT 1

  def self.list_animal_likes_food(animal_name)
    animal = Animal.includes(:liked_foods).find_by(name: animal_name)
---
SELECT "animals".* FROM "animals" WHERE "animals"."name" = 'Cat' LIMIT 1
SELECT "foods".* FROM "foods" WHERE "foods"."name" IN ('Cat Food', 'Chicken', 'Milk')