demo-ruby-classes-rails-api/app/services/food_service.rb

  def self.list_food_liked_by_animals(food_name)
    food = Food.includes(:liked_by_animals).find_by(name: food_name)
---
SELECT "animals".* FROM "animals" WHERE "animals"."name" = 'Dog'
SELECT "foods".* FROM "foods" WHERE "foods"."name" = 'Dog Food' LIMIT 1